In [1]:
import pandas as pd

In [5]:
#Load the Toyota sales dataset
toyota_sales_data = pd.read_csv("toyota_sales_data.csv")

In [6]:
toyota_sales_data

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,NaN,Pending
2,3,5,2024-11-03,Corolla,20275.08,NaN,Completed
3,4,20,2024-11-06,Corolla,20068.93,NaN,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed
...,...,...,...,...,...,...,...
4995,4996,1,2024-11-06,Corolla,21484.83,0.05,Completed
4996,4997,8,2024-11-11,Camry,26519.24,0.05,Pending
4997,4998,18,2024-11-06,Tacoma,30780.39,0.02,Completed
4998,4999,10,2024-11-21,Corolla,22654.59,NaN,Completed
4999,5000,13,2024-11-21,Tundra,44525.85,NaN,Cancelled

In [7]:
toyota_sales_data["sale_rep_id"].unique()

array([16, 11,  5, 20,  1, 14, 12,  3,  9, 13,  2, 18,  8,  4,  6,  7, 17,
       10, 19, 15])

In [10]:
toyota_sales_data.groupby("sale_rep_id")["sale_amount"].sum()

sale_rep_id
1     8793624.75
2     8721864.31
3     7483168.82
4     7473215.23
5     7814744.92
6     8089256.01
7     8658437.14
8     8672081.85
9     8623533.39
10    7822524.30
11    7946648.50
12    8493429.13
13    8012200.98
14    8268540.28
15    8218385.64
16    8161330.01
17    8247398.75
18    8759602.34
19    8788981.01
20    7849573.71
Name: sale_amount, dtype: float64

In [11]:
toyota_sales_data.groupby("car_model")["sale_amount"].sum()

car_model
Camry         23515068.85
Corolla       18559680.22
Highlander    32562337.53
RAV4          26647722.94
Tacoma        28908731.32
Tundra        34705000.21
Name: sale_amount, dtype: float64

In [12]:
toyota_sales_data.groupby("car_model")["sale_amount"].mean()

car_model
Camry         27470.874825
Corolla       22442.176808
Highlander    40002.871658
RAV4          30985.724349
Tacoma        34998.464068
Tundra        42478.580428
Name: sale_amount, dtype: float64

In [13]:
toyota_sales_data["sale_status"].unique()

array(['Completed', 'Pending', 'Cancelled'], dtype=object)

In [16]:
toyota_sales_data.groupby("sale_rep_id")["sale_amount"].\
    agg(["sum","mean"])

                    sum          mean
sale_rep_id
1            8793624.75  32934.924157
2            8721864.31  32788.963571
3            7483168.82  33556.810852
4            7473215.23  32073.885107
5            7814744.92  32426.327469
6            8089256.01  33705.233375
7            8658437.14  32673.347698
8            8672081.85  33612.720349
9            8623533.39  32789.100342
10           7822524.30  33429.591026
11           7946648.50  32435.300000
12           8493429.13  33438.697362
13           8012200.98  33384.170750
14           8268540.28  33611.952358
15           8218385.64  32873.542560
16           8161330.01  32131.220512
17           8247398.75  32858.162351
18           8759602.34  32930.835865
19           8788981.01  32672.791859
20           7849573.71  33402.441319